{
  "app_name": "Portefeuille",
  "about_me": "À propos de moi",
  "data_analytics": "Projets d'analyse de données",
  "web_app": "Projets d'application web",
  "contact_me": "Contactez-moi",
  "homepage_slogan": [
    "Bonjour le monde!",
    "Je m'appelle Haiyan, enchantée de vous rencontrer."
  ],
  "web_app_project": [
    {
      "project": "Broker Ease",
      "language": "Typescript",
      "database": "MySQL, AWS RDS",
      "packages": "Koa, Knex, bcrypt, cors, dayjs, dotenv, jsonwebtoken, multer, mysql2, nodemailer, zod.",
      "other_tools": "AWS, GitHub, Docker",
      "github_link": "Privé",
      "web_app_link": "https://brokerease.netlify.app/login",
      "description": "C'est une application web qui permet aux courtiers de partager des propriétés avec des clients dans un espace partagé et de communiquer avec eux dans cet espace. Elle vise à simplifier la communication quotidienne des courtiers avec leurs clients, à suivre les intérêts des clients et à aider les courtiers à augmenter leur taux de transaction.",
      "workflow": [
        "Conception de la base de données : Conception de la structure de la base de données avec draw.io et création des fichiers de migration avec Knex.",
        "Configuration de la base de données : Mise en place et configuration d'une base de données AWS RDS pour une utilisation en production.",
        "Développement des API : Création de 25 API RESTful (auth, propriétés, recherche, utilisateurs, tableau de bord) pour gérer les fonctionnalités principales de l'application.",
        "Test : Utilisation de Postman pour tester minutieusement toutes les API avec des données de test.",
        "Containerisation : Utilisation de Docker pour des environnements de développement et de déploiement cohérents.",
        "Déploiement : Déploiement de l'application sur AWS, garantissant évolutivité et sécurité.",
        "Collaboration : Collaboration avec les développeurs frontend via GitHub pour intégrer et améliorer les fonctionnalités.",
        "Méthodologie Agile : Travail dans des environnements Agile et Scrum pour livrer des logiciels de haute qualité en collaboration avec des équipes multifonctionnelles."
      ]
    },
    {
      "project": "Portfolio",
      "language": "Javascript",
      "database": "N/A (stockage local)",
      "packages": "react, react-router, react-router-dom, react-i18next, i18next, emailjs-com, @mui/material, @mui/icons-material",
      "other_tools": "GitHub",
      "github_link": "https://github.com/Haiyan-Zhang-codes/Haiyan-Zhang-codes.github.io",
      "web_app_link": "https://haiyan-zhang-codes.github.io/en/home",
      "description": "Il s'agit d'une page web frontend basée sur React présentant mon portfolio.",
      "workflow": [
        "Créer une application React dans un environnement d'exécution Node.js.",
        "Créer la structure des fichiers en fonction des pages.",
        "Installer toutes les dépendances.",
        "Créer des fichiers translation.json pour l'anglais (en) et le français (fr).",
        "Créer des paramètres de thème personnalisés en utilisant MUI.",
        "Créer des composants et des widgets pour différentes utilisations sur diverses pages.",
        "Créer les pages et exécuter l'application pour identifier les ajustements nécessaires du style, en utilisant MUI et styles.css pour la mise en page.",
        "Utiliser un pipeline CI/CD pour déployer l'application sur GitHub."
      ]
    }
  ],
  "data_analysis_project": [
    {
      "project": "Étude de cas Capstone_Bellabeat",
      "language": "Python",
      "database": "MySQL",
      "packages": "pandas, numpy, matplotlib",
      "other_tools": "Jupiter, Kaggle, Excel",
      "github_link": "https://www.kaggle.com/code/haiyanzhang1982/capstone-case-study-bellabeat",
      "web_app_link": "N/A",
      "description": "Ce projet analyse les données des trackers de santé publique pour identifier les comportements des utilisateurs et découvrir des opportunités de vente pour les appareils intelligents de Bellabeat.",
      "workflow": [
        "Demander : Analyser les données d'utilisation de dispositifs intelligents externes afin de comprendre comment les consommateurs utilisent les appareils intelligents non Bellabeat et appliquer ces connaissances à un produit Bellabeat.",
        "Préparer : Télécharger le jeu de données depuis Kaggle et le stocker sur ma machine locale ; j'importe toutes les données dans une base de données MySQL, renomme les fichiers avec un suffixe de date, puis importe les fichiers dans Kaggle input, utilise Python pour analyser les données ; évaluer la crédibilité des données.",
        "Traiter : Gestion des données manquantes ; gestion des doublons ; renommer les colonnes ; convertir les dates en datetime ; fusionner les données nettoyées et les enregistrer dans un nouveau fichier ; remplir les valeurs NaN par 0.",
        "Analyser : Corrélation ; catégoriser les utilisateurs par minutes très actives moyennes ; catégoriser les utilisateurs par pas moyens ; analyse de la sédentarité.",
        "Partager : Visualisation des résultats de l'analyse à l'aide de diagrammes circulaires, de graphiques en barres et de nuages de points.",
        "Agir : Appliquer les connaissances à l'entreprise et, en fonction des résultats de l'analyse, fournir des recommandations pour Bellabeat."
      ]
    }
  ],
  "about_me_page": [
    {
      "title": "JE FAÇONNE MON AVENIR",
      "slogan": {
        "main": "Les étapes clés de ma vie",
        "sub": "Fixer l'objectif, réaliser le rêve"
      },
      "image": [
        "/assets/pic1/child.jpg",
        "/assets/pic1/vocational school.JPG",
        "/assets/pic1/family.JPG",
        "/assets/pic1/dicos.JPG",
        "/assets/pic1/emica.jpg",
        "/assets/pic1/vocational.JPG"
      ],
      "description": [
        "Première 'migration' : Du statut de résidence rurale à celui de résidence urbaine. Si vous êtes curieux, il s'agit d'un système unique à la Chine, où le 'hukou', le registre des ménages, détermine non seulement l'accès aux prestations sociales, mais aussi l'identité sociale. À l'âge de 15 ans, j'ai réussi le 'Zhongkao' (un examen spécifique au système éducatif chinois) et intégré une école secondaire professionnelle, ce qui m'a permis de passer du statut de résident rural à celui de résident urbain.",
        "Premier emploi idéal : Bien que mon diplôme d'école professionnelle m'ait permis de changer de statut de résidence, mon niveau d'éducation ne m'a permis de trouver que des emplois dans la vente. Afin d'intégrer le secteur qui me faisait rêver, j'ai entrepris des études autodidactes et obtenu un diplôme de technicien supérieur en gestion des entreprises. Grâce à ce diplôme, j'ai pu intégrer Ting Hsin International Group, une entreprise classée au Fortune 500, en tant que stagiaire en gestion. Durant la décennie qui a suivi, je suis passé de stagiaire à directeur régional.",
        "Immigration au Canada : L'automne canadien et le bonheur de voir grandir mon enfant m'ont attiré ici. Avec mon enfant de trois ans, je me suis lancée seule dans cette aventure. J'ai étudié l'anglais et le français, obtenu un diplôme DEP en soutien informatique, et réussi l'examen de français TEFAQ au niveau B2. J'ai ensuite trouvé mon premier emploi au Canada en tant que spécialiste produit chez Shopper Plus, où j'ai accumulé l'expérience nécessaire pour satisfaire les critères du programme PEQ. Cinq ans après mon arrivée au Canada, j'ai obtenu ma résidence permanente.",
        "J'ai décroché mon premier emploi au Canada en tant que spécialiste du commerce électronique."
      ]
    },
    {
      "title": "JE SUIS ICI",
      "slogan": { "main": "Canada", "sub": "Là où mes rêves commencent" },
      "image": [
        "/assets/pic1/channel.JPG",
        "/assets/pic1/google analytics.png",
        "/assets/pic1/cx50.png"
      ],
      "description": [
        "J'ai déménagé au Canada avec mon fils de 3 ans.",
        "J'ai appris le français à partir de zéro, atteignant le niveau B2. ",
        "J'ai obtenu un DEP en soutien informatique.",
        "J'ai décroché mon premier emploi au Canada en tant que spécialiste de produit chez ShopperPlus.",
        "J'ai créé une chaîne personnelle pour partager des informations et des conseils sur l'immigration au Canada. ",
        "J'ai obtenu un certificat en informatique.",
        "J'ai obtenu un certificat en analyse de données Google.",
        "J'ai terminé une formation en développement d'applications web full-stack sur Coursera. "
      ]
    },
    {
      "title": "LES ENDROITS QUE J'AI PARCOURUS",
      "slogan": { "main": "Voyage", "sub": "Ce qui alimente ma créativité" },
      "image": [
        "/assets/pic1/v1.PNG",
        "/assets/pic1/v2.JPG",
        "/assets/pic1/v3.JPG",
        "/assets/pic1/h1.JPG",
        "/assets/pic1/h2.JPG",
        "/assets/pic1/h3.JPG"
      ],
      "description": [
        "Chaque ville en Chine",
        "Népal",
        "Corée",
        "Singapour",
        "Malaisie",
        "Japon",
        "Vietnam",
        "Cambodge",
        "Tibet",
        "États-Unis : Californie, New York",
        "Canada : Alberta, Ontario, Québec",
        "Apprécier les hivers et les étés du Canada"
      ]
    }
  ],
  "contact_me_page": {
    "name": "Votre Nom",
    "company": "Entreprise",
    "email": "Courriel",
    "message": "Message"
  }
}
