{
  "app_name": "Portfolio",
  "about_me": "About Me",
  "data_analytics": "Data Analytics Projects",
  "web_app": "Web Application Projects",
  "contact_me": "Contact Me",
  "homepage_slogan": ["Hello World!", "My name is Haiyan, nice to meet you."],
  "web_app_project": [
    {
      "project": "Broker Ease",
      "language": "Typescript",
      "database": "MySQL, AWS RDS",
      "packages": "Koa, Knex, bcrypt, cors, dayjs, dotenv, jsonwebtoken, multer, mysql2, nodemailer, zod.",
      "other_tools": "AWS, GitHub, Docker",
      "github_link": "Private",
      "web_app_link": "https://brokerease.netlify.app/login",
      "description": "This is a web application that allows brokers to share properties with clients in a shared space and communicate with them within that space. It aims to simplify brokers' daily communication with clients, track clients' interests, and help brokers increase their transaction rate.",
      "workflow": [
        "Database Design: Designed the database structure using draw.io, and created migration files using Knex.",
        "Database Configuration: Set up and configured an AWS RDS database for production use.",
        "API Development: Built 25 RESTful APIs (auth, properties, search, users, dashboard) to handle core application functionalities.",
        "Testing: Utilized Postman to thoroughly test all APIs with seed data.",
        "Containerization: Leveraged Docker for consistent development and deployment environments.",
        "Deployment: Deployed the application on AWS, ensuring scalability and security.",
        "Collaboration: Collaborated with frontend developers via GitHub to integrate and enhance features.",
        "Agile Methodology: Worked in Agile and Scrum environments to deliver high-quality software in collaboration with cross-functional teams."
      ]
    },
    {
      "project": "Portfolio",
      "language": "Javascript",
      "database": "N/A (local storage)",
      "packages": "react, react-router, react-router-dom, react-i18next, i18next, emailjs-com, @mui/material, @mui/icons-material",
      "other_tools": "GitHub",
      "github_link": "https://github.com/Haiyan-Zhang-codes/Haiyan-Zhang-codes.github.io",
      "web_app_link": "https://haiyan-zhang-codes.github.io/en/home",
      "description": "This is a React-based frontend web page showcasing my portfolio.",
      "workflow": [
        "Create a React app in a Node.js runtime environment.",
        "Create the file structure based on the pages.",
        "Install all dependencies.",
        "Create translation.json files for both English (en) and French (fr).",
        "Create custom theme settings using MUI.",
        "Create components and widgets for different uses on various pages.",
        "Create the pages and run the app to identify any necessary style adjustments, using MUI and styles.css for page styling.",
        "Use a CI/CD pipeline to deploy the app on GitHub."
      ]
    }
  ],
  "data_analysis_project": [
    {
      "project": "Capstone_Case Study_Bellabeat",
      "language": "Python",
      "database": "MySQL",
      "packages": "pandas, numpy, matplotlib",
      "other_tools": "Jupiter, Kaggle, Excel",
      "github_link": "https://www.kaggle.com/code/haiyanzhang1982/capstone-case-study-bellabeat",
      "web_app_link": "N/A",
      "description": "This project analyzes public health tracker data to identify user behavior patterns and uncover sales opportunities for Bellabeat's smart devices.",
      "workflow": [
        "Ask: Analyze external smart device usage data in order to gain insight into how consumers use non-Bellabeat smart devices, apply the insights to one Bellabeat product.",
        "Prepare: Dowload the dataset from Kaggle and store it on my local machine;I import all the data into MySQL Database, and renamed files with date suffix, then import files to Kaggle input, use Python to investigate data;Determine the credibility of the data",
        "Process: Handling Missing Data; Handling Duplicates; Renaming columns; Convert dates to datetime; Merge cleaned data and save to a new file; Fill NaN with 0",
        "Analyze: Correlation; Categorize users by average very active minutes; Categorize users by average steps; Sedentary analysis",
        "Share: Visualization of analysis results using pie charts, bar charts, and scatter plots.",
        "Act: Apply the insights to business, based on the analysis results, providing recommendations for Bellabeat."
        
      ]
    }
  ],
  "about_me_page": [
    {
      "title": "I SHAPE MY FUTURE",
      "slogan": {
        "main": "My Life Milestones",
        "sub": "Set the goal, achieve the dream"
      },
      "image": [
        "/assets/pic1/child.jpg",
        "/assets/pic1/vocational school.JPG",
        "/assets/pic1/family.JPG",
        "/assets/pic1/dicos.JPG",
        "/assets/pic1/emica.jpg",
        "/assets/pic1/vocational.JPG"
      ],
      "description": [
        "First 'Migration': From a rural household registration to an urban one. If you're curious, this is a system unique to China, where household registration (or 'hukou') determines not only access to social benefits but also social identity. At the age of 15, I passed the 'Zhongkao' (a Chinese examination system) and entered a vocational secondary school, thus achieving the transition from rural to urban registration.",
        "First Ideal Job: Although graduating from vocational school granted me an urban household registration, my educational background limited me to sales-related positions. In pursuit of my dream career, I took the initiative to study for and earn an associate degree in Business Administration through a self-taught examination process. This allowed me to join Ting Hsin International Group, a Fortune 500 company, as a management trainee. Over the next decade, I worked my way up from a trainee to a regional manager.",
        "Immigrating to Canada: The allure of Canada's autumn and the joy of seeing my child grow happily drew me in. With my three-year-old in tow, I embarked on the journey to Canada alone. I studied English and French, earned a DEP diploma in Computer Support, and passed the French TEFAQ exam at the B2 level. I then secured my first job in Canada as a Product Specialist at Shopper Plus, gaining valuable work experience to meet the requirements for the PEQ program. Five years after arriving in Canada, I obtained my permanent residency.",
        "During my Computer Support studies, I was introduced to programming for the first time. In my first job, I worked extensively with HTML and CSS, creating product web pages. I found joy in seeing lines of code transform into beautiful web pages in an instant. The sense of accomplishment I felt in those moments solidified my new career direction. I continued to enrich my knowledge through online courses. Now, as I prepare to take flight toward this new dream, I need your support..."
      ]
    },
    {
      "title": "I AM HERE",
      "slogan": { "main": "Canada", "sub": "Where my dreams begin" },
      "image": [
        "/assets/pic1/channel.JPG",
        "/assets/pic1/google analytics.png",
        "/assets/pic1/cx50.png"
      ],
      "description": [
        "Moved to Canada with my 3-year-old son.",
        "Learned French from scratch, reaching B2 level.",
        "Earned a DEP in computer support.",
        "Landed my first job in Canada as a Product Specialist at ShopperPlus.",
        "Created a personal channel to share insights and information on immigrating to Canada.",
        "Obtained a computer science certificate.",
        "Earned a Google Data Analytics certificate.",
        "Completed full-stack web application development on Coursera."
      ]
    },
    {
      "title": "PLACES I'VE ROAMED",
      "slogan": { "main": "Travel", "sub": "What Fuels My Creativity" },
      "image": [
        "/assets/pic1/v1.PNG",
        "/assets/pic1/v2.JPG",
        "/assets/pic1/v3.JPG",
        "/assets/pic1/h1.JPG",
        "/assets/pic1/h2.JPG",
        "/assets/pic1/h3.JPG"
      ],
      "description": [
        "Every city in China",
        "Nepal",
        "Korea",
        "Singapore",
        "Malaysia",
        "Japan",
        "Vietnam",
        "Cambodia",
        "Tibet",
        "USA: California, New York",
        "Canada: Alberta, Ontario, Quebec",
        "Embracing both Canada's winter and summer seasons"
      ]
    }
  ],
  "contact_me_page": {
    "name": "Your Name",
    "company": "Company",
    "email": "Email",
    "message": "Message"
  }
}
